OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/potential/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.14;
        value           uniform 0.14;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0.14;
        value           uniform 0.14;
    }
    frontAndBack
    {
        type            empty;
    }
    coupled
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
