OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/potential/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

force1
{
    type        forceCoeffs;
    functionObjectLibs ( "libforces.so" );
    outputControl timeStep;
    outputInterval 1;

    patches     (wall);
    pName       p;
    UName       U;
    rhoName     rhoInf;      // Indicates incompressible
    log         true;
    rhoInf      1;           // Redundant for incompressible
    liftDir     (0 1 0);
    dragDir     (1 0 0);
    CofR        (0.0 0 0);  // Axle midpoint on ground
    pitchAxis   (0 0 1);
    magUInf     1;
    lRef        1;        // Wheelbase length
    Aref        1;        // Estimated
}



// ************************************************************************* //
